
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user  perpetual
Serial number: 401806333935
  Licensed to: Pierre Georg
               University of Cape Town

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do "/Users/pierregeorg/Git/SoftwareNetworks/52_prepare_covariates_NPM-test.do
> " 

. // ==========================================================================
> ==
. //
. // NPM -- 1.6.0 -- TEST
. //
. // ==========================================================================
> ==
. cd ~/Downloads/NPM-test/ 
/Users/pierregeorg/Downloads/NPM-test

. 
. // PREPARE WYSS DATA
. insheet using "Wyss_npm-test_data.csv", delimiter(",") clear
(645 vars, 3 obs)

.         rename package projectname 

.         sort projectname

.         
.         // create repo-based variables
.         split repository, parse("https://github.com/")
variables created as string: 
repository1  repository2

.         drop repository1

.         split repository2, parse("/")
variables created as string: 
repository21  repository22

.         drop repository2

.         
.         rename repository22 repo

.         rename repository21 repo_user 

.         
.         order repo repo_user repository 

.         drop projectname

. save "Wyss_npm-test_data.dta", replace
file Wyss_npm-test_data.dta saved

. 
. use Wyss_npm-test_data.dta, clear

.         sort repo       

.         rename weekly_downloads downloads

.         order repo repo_user repository downloads vulnerabilities issues_per_
> download size versions commits contributors open_issues closed_issues commits
> _with_bug commits_with_vuln mean_loc-halstead stars watchers forks issues

.         keep repo repo_user repository  downloads vulnerabilities issues_per_
> download size versions commits contributors open_issues closed_issues commits
> _with_bug commits_with_vuln mean_loc-halstead stars watchers forks issues

.         
.         foreach var of varlist downloads-issues {
  2.                         bysort repo: egen foo = mean(`var')
  3.                         drop `var'
  4.                         rename foo `var'
  5.         }

.         bysort repo: gen num_packages = _N 

.         duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

.         
.         bysort repo: gen foo = _N  // forking repos means that some packages 
> have multiple repositories which might or might not be distinct

.         drop if foo > 1  // drop those
(0 observations deleted)

.         drop foo

.         
.         gen id_repo = _n        

. save Wyss_npm-test_data2.dta, replace
file Wyss_npm-test_data2.dta saved

. outsheet using Wyss_npm-test_data2.csv, delimiter(";") names replace

. 
. use Wyss_npm-test_data2.dta, clear

.         keep repo id_repo

. save repo_id_repo-Wyss.dta, replace
file repo_id_repo-Wyss.dta saved

. 
. 
. // ANALYSIS BASED ON REPO DEPENDENCIES 
. insheet using repo_dependencies_NPM-test-matchedWyss.csv, names delimiter(";"
> ) clear
(2 vars, 2 obs)

. 
.         rename from_repo repo 

. merge m:1 repo using repo_id_repo-Wyss.dta  // using the Wyss unique IDs 

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    Matched                                 2  (_merge==3)
    -----------------------------------------

.         drop if _merge != 3
(1 observation deleted)

.         drop _merge 

.         rename repo from_repo

.         rename id_repo id_from_repo 

. 
.         rename to_repo repo 

. merge m:1 repo using repo_id_repo-Wyss.dta
(variable repo was str3, now str5 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         0  (_merge==1)
        from using                          2  (_merge==2)

    Matched                                 2  (_merge==3)
    -----------------------------------------

.         drop if _merge != 3
(2 observations deleted)

.         drop _merge 

.         rename repo to_repo

.         rename id_repo id_to_repo 

. 
.         duplicates drop 

Duplicates in terms of all variables

(0 observations are duplicates)

.         
.         sort id_from_repo id_to_repo  // based on Wyss unique IDs       

.         keep id_from_repo id_to_repo

. 
. outsheet using repo_dependencies_NPM-test-matchedWyss+IDs.csv, nonames delimi
> ter(";") replace

. 
. 
. // check which repos exist in the final dependencies file...
. insheet using repo_dependencies_NPM-test-matchedWyss+IDs.csv, nonames delimit
> er(";") clear
(2 vars, 2 obs)

.         rename v1 id_repo 

.         drop v2 

.         duplicates drop 

Duplicates in terms of all variables

(0 observations are duplicates)

. save tmp.dta, replace
file tmp.dta saved

. 
. insheet using repo_dependencies_NPM-test-matchedWyss+IDs.csv, nonames delimit
> er(";") clear
(2 vars, 2 obs)

.         rename v2 id_repo 

.         drop v1

.         duplicates drop

Duplicates in terms of all variables

(1 observation deleted)

. append using tmp.dta 

.         duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. save id_repos_dependencies.dta, replace
file id_repos_dependencies.dta saved

. 
. // ...then make sure that all of those exist in Wyss data
. insheet using Wyss_npm-test_data2.csv, names delimiter(";") clear
(29 vars, 3 obs)

. merge 1:1 id_repo using id_repos_dependencies.dta

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 3  (_merge==3)
    -----------------------------------------

.         keep if _merge == 3
(0 observations deleted)

.         drop _merge

. outsheet using Wyss_npm-test_data3.csv, names delimiter(";") replace

. 
. // lastly, re-generate ids so that Wyss data has consecutive numbering
. insheet using Wyss_npm-test_data3.csv, names delimiter(";") clear
(29 vars, 3 obs)

.         sort repo

.         gen id_repo_new = _n 

.         order id_repo id_repo_new repo

. outsheet using Wyss_npm-test_data5.csv, names delimiter(";") replace

. outsheet using Master/Wyss_npm-test_data5.csv, names delimiter(";") replace

.         keep id_repo id_repo_new 

. save id_repo_new.dta, replace
file id_repo_new.dta saved

. 
. insheet using repo_dependencies_NPM-test-matchedWyss+IDs.csv, nonames delimit
> er(";") clear
(2 vars, 2 obs)

.         rename v1 id_repo 

. merge m:1 id_repo using id_repo_new.dta 

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         0  (_merge==1)
        from using                          1  (_merge==2)

    Matched                                 2  (_merge==3)
    -----------------------------------------

.         drop if _merge == 2
(1 observation deleted)

.         drop _merge 

.         rename id_repo_new id_repo_from 

.         drop id_repo

.         
.         rename v2 id_repo 

. merge m:1 id_repo using id_repo_new.dta 

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         0  (_merge==1)
        from using                          2  (_merge==2)

    Matched                                 2  (_merge==3)
    -----------------------------------------

.         drop if _merge == 2
(2 observations deleted)

.         drop _merge 

.         rename id_repo_new id_repo_to 

.         drop id_repo

.         
.         sort id_repo_from id_repo_to

. outsheet using repo_dependencies_NPM-test-matchedWyss+newIDs.csv, nonames del
> imiter(";") replace

. // this is the file the network file is created with using 30_create_dependen
> cy_graph-1.6.0.py
. // it does not contain bad identifiers and uses new consecutive IDs
. 
end of do-file
